// JavaScript Document
// JavaScript Document
	// 路径配置

	// 使用
	DrawCharts_sz(0);
	function DrawCharts_sz(num,time,data1,data2){
		var tab_index = parseInt(num);
		var currDate = time;
		var series_jz_Data = data1;
		var series_hs_Data = data2;
		getPos(2879,2819,2839);
		require.config({
			paths: {
				echarts: 'http://echarts.baidu.com/build/dist'
			}
		});
		require(
			[
				'echarts',
				'echarts/theme/macarons', 
				'echarts/chart/line' ,
				'echarts/chart/bar'
			],
		function (ec,theme) {  
				   //--- 折柱 ---  
				  // alert(hover_index);
			var myChart3 = ec.init(document.getElementById('sz_echarts'),e_macarons);
			var option = {
			tooltip : {
				trigger: 'item',//axis有背景的蓝色线，item时没有蓝色线
			},
			calculable : true,
			/*legend: {
				data:['当日净值']
			},*/
		   grid :{
				  x: '62',
				  y: '10',
				  x2:'55',
				  y2:'25',
				  borderWidth :0
			  },
			toolbox: {
				show : false,
				feature : {
					mark : {show: true},
					dataView : {show: true},
					magicType : {show: true, type: ['line', 'bar']},
					restore : {show: true},
					saveAsImage : {show: true}
				}
			},
			xAxis : [
				{
					type : 'category',
					boundaryGap: true,
					interval :'auto',
					axisTick :false,
					axisLine : {    // 轴线
						onZero:false,
						show:true,
						lineStyle:{
							color: '#dfe4ea',
							width: 1,
							type: 'solid'
						}
					},
					splitLine : {
						show: false
					},
					axisLabel :{
						interval:59,
						textStyle :{
							fontSize:14,
							color : '#1c202b'
						}
					},
					data : [
               			 '9:30','9:31','9:32','9:33','9:34','9:35','9:36','9:37','9:38','9:39','9:40','9:41','9:42','9:43','9:44','9:45','9:46','9:47','9:48','9:49','9:50','9:51','9:52','9:53','9:54','9:55','9:56','9:57','9:58','9:59',
	'10:00','10:01','10:02','10:03','10:04','10:05','10:06','10:07','10:08','10:09','10:10','10:11','10:12','10:13','10:14','10:15','10:16','10:17','10:18','10:19','10:20','10:21','10:22','10:23','10:24','10:25','10:26','10:27','10:28','10:29','10:30','10:31','10:32','10:33','10:34','10:35','10:36','10:37','10:38','10:39','10:40','10:41','10:42','10:43','10:44','10:45','10:46','10:47','10:48','10:49','10:50','10:51','10:52','10:53','10:54','10:55','10:56','10:57','10:58','10:59',
	'11:00','11:01','11:02','11:03','11:04','11:05','11:06','11:07','11:08','11:09','11:10','11:11','11:12','11:13','11:14','11:15','11:16','11:17','11:18','11:19','11:20','11:21','11:22','11:23','11:24','11:25','11:26','11:27','11:28','11:29',
	'11:00/13:00','13:01','13:02','13:03','13:04','13:05','13:06','13:07','13:08','13:09','13:10','13:11','13:12','13:13','13:14','13:15','13:16','13:17','13:18','13:19','13:20','13:21','13:22','13:23','13:24','13:25','13:26','13:27','13:28','13:29','13:30','13:31','13:32','13:33','13:34','13:35','13:36','13:37','13:38','13:39','13:40','13:41','13:42','13:43','13:44','13:45','13:46','13:47','13:48','13:49','13:50','13:51','13:52','13:53','13:54','13:55','13:56','13:57','13:58','13:59',
	'14:00','14:01','14:02','14:03','14:04','14:05','14:06','14:07','14:08','14:09','14:10','14:11','14:12','14:13','14:14','14:15','14:16','14:17','14:18','14:19','14:20','14:21','14:22','14:23','14:24','14:25','14:26','14:27','14:28','14:29','14:30','14:31','14:32','14:33','14:34','14:35','14:36','14:37','14:38','14:39','14:40','14:41','14:42','14:43','14:44','14:45','14:46','14:47','14:48','14:49','14:50','14:51','14:52','14:53','14:54','14:55','14:56','14:57','14:58','14:59','15:00'
	
            			]
				},
			],
		  
			yAxis : [
				{
					type : 'value',
					splitNumber: 6,
					min : 2819,
					max : 2879,
					//boundaryGap: [0,0.1],
				   /* axisLine : true,*/
					axisLabel : {
						show:true,
						interval: 'auto',    // {number}
						formatter: '{value}',
									textStyle :{
										color: '#1c202b',
										fontSize:14
									}
					},
					axisLine : {    // 轴线
						lineStyle:{
							color: '#dfe4ea',
							width: 1,
							type: 'solid'
						}
					},
					splitLine : {
						show: true
					}
				},
				{
					type : 'value',
					splitNumber: 6,
					min : -0.15,
					max : -0.09,
					//boundaryGap: [0,0.1],
				   /* axisLine : true,*/
					axisLabel : {
						show:true,
						interval: 'auto',    // {number}
						formatter: '{value}%',
									textStyle :{
										color: '#1c202b',
										fontSize:14
									}
					},
					axisLine : {    // 轴线
						lineStyle:{
							color: '#dfe4ea',
							width: 1,
							type: 'solid'
						}
					},
					splitLine : {
						show: true
					}
				}
			],
			series : [
				{
					name:'沪深300',
					type: 'line',
					z : 2,
					//smooth: true,
					symbolSize : 4,
					symbol : 'none',/*不显示曲线上面的圈*/
					yAxisIndex: 0,
					itemStyle: {
						normal: {
							color : 'rgba(38,140,236,1)',
							lineStyle : {
								width : 1
							},
							areaStyle: {
								type: 'default',
								color:'rgba(38,140,236,0.2)'
							}
						}
					},
					markLine : {
						large : true,/*关闭标线从左到右绘制的动作*/
						itemStyle:{
							normal:{
								color:'rgba(105,167,247,1)',
								lineStyle:{
									width:1,/*线宽*/
									type:'dashed',/*线的形状可选为：'solid' | 'dotted' | 'dashed'*/
								}
							}
						},
						data : [
							[
								{name: '标线1起点', x: 62, y: linePos},
								{name: '标线1终点', x: 709, y: linePos}
							]
							/*{type : 'average', name: '最大值', itemStyle:{normal:{color:'#dc143c'}}},*/
						]
					},
					data: [2819, 2820, 2821, 2822, 2823, 2824, 2824, 2825, 2825, 2829,2828,2824,2820,2824,2829,2820,2824,2826,2828,2830,2832,2833,2834,2834,2834,2830,2834,2835,2836,2837,2839,2835,2834,2830,2539,2834,2835,2839,2838,2837,2836,2835,2830,2834,2835,2836,2837,2838,2838,2833,2832,2836,2839,2837,2839,2835,2834,2837,2539,2840,2845,2849,2848,2847,2846,2845,2840,2849,2840,2841,2840,2842,2848,2843,2842,2846,2849,2849,2845,2844,2840,2549,2844,2845,2849,2848,2847,2846,2845,2844,2849,2845,2846,2849,2844,2848,2849,2849,2846,2849,2819, 2820, 2821, 2822, 2823, 2824, 2824, 2825, 2825, 2829,2828,2824,2820,2824,2829,2820,2824,2826,2828,2830,2832,2833,2834,2834,2834,2830,2834,2835,2836,2837,2839,2835,2834,2830,2539,2834,2835,2839,2838,2837,2836,2835,2830,2834,2835,2836,2837,2838,2838,2833,2832,2836,2839,2837,2839,2835,2834,2837,2539,2840,2845,2849,2848,2847,2846,2845,2840,2849,2840,2841,2840,2842,2848,2843,2842,2846,2849,2849,2845,2844,2840,2549,2844,2845,2849,2848,2847,2846,2845,2844,2849,2845,2846,2849,2844,2848,2849,2849,2846,2849]
				}
			]
		};               
			// 为echarts对象加载数据 
			myChart3.setOption(option); 
		}
		  );
	}
function getPos(maxData,minData,zoneData){
	var gap = maxData - minData;
	linePos = parseInt(4.7*(maxData-zoneData)+10);
}
